# Eat Safe, Love

## Notebook Set Up

In [1]:
# Import dependencies
from pymongo import MongoClient
from pprint import pprint
import pandas as pd

In [2]:
# Create an instance of MongoClient
mongo = MongoClient(port=27017)

In [3]:
# assign the uk_food database to a variable name
db = mongo['uk_food']

In [4]:
# review the collections in our database
db.list_collection_names()

['establishments']

In [5]:
# assign the collection to a variable
establishments = db['establishments']

In [6]:
#ADDED CELL
establishments.find_one()

{'_id': ObjectId('64f1584313cdc07f1c2bce68'),
 'FHRSID': 1043695,
 'ChangesByServerID': 0,
 'LocalAuthorityBusinessID': 'PI/000073616',
 'BusinessName': 'The Pavilion',
 'BusinessType': 'Restaurant/Cafe/Canteen',
 'BusinessTypeID': 1,
 'AddressLine1': 'East Cliff Pavilion',
 'AddressLine2': 'Wear Bay Road',
 'AddressLine3': 'Folkestone',
 'AddressLine4': 'Kent',
 'PostCode': 'CT19 6BL',
 'Phone': '',
 'RatingValue': 5,
 'RatingKey': 'fhrs_5_en-gb',
 'RatingDate': '2018-04-04T00:00:00',
 'LocalAuthorityCode': '188',
 'LocalAuthorityName': 'Folkestone and Hythe',
 'LocalAuthorityWebSite': 'http://www.folkestone-hythe.gov.uk',
 'LocalAuthorityEmailAddress': 'foodteam@folkestone-hythe.gov.uk',
 'scores': {'Hygiene': 5, 'Structural': 5, 'ConfidenceInManagement': 5},
 'SchemeType': 'FHRS',
 'geocode': {'longitude': 1.195625, 'latitude': 51.083812},
 'RightToReply': '',
 'Distance': 4591.765489457773,
 'NewRatingPending': False,
 'meta': {'dataSource': None,
  'extractDate': '0001-01-01T00:00:00',
  'itemCount': 0,
  'returncode': None,
  'totalCount': 0,
  'totalPages': 0,
  'pageSize': 0,
  'pageNumber': 0},
 'links': [{'rel': 'self',
   'href': 'https://api.ratings.food.gov.uk/establishments/1043695'}]}

## Part 3: Exploratory Analysis
Unless otherwise stated, for each question: 
* Use `count_documents` to display the number of documents contained in the result.
* Display the first document in the results using `pprint`.
* Convert the result to a Pandas DataFrame, print the number of rows in the DataFrame, and display the first 10 rows.

### 1. Which establishments have a hygiene score equal to 20?

In [7]:
# Find the establishments with a hygiene score of 20

# Creating Query
query1 = {'scores.Hygiene': 20}

# Creating Fields to Display to Minimize Clutter
fields1 = {'BusinessName': 1, 'scores.Hygiene': 1, '_id': 0}

# Finding Results
results1 = list(establishments.find(query1, fields1))

# Use count_documents to display the number of documents in the result
print(establishments.count_documents(query1))

# Display the first document in the results using pprint
pprint(results1[0])

41
{'BusinessName': 'The Chase Rest Home', 'scores': {'Hygiene': 20}}

In [8]:
# Convert the result to a Pandas DataFrame
results1_df = pd.json_normalize(results1)

# Display the number of rows in the DataFrame
pprint(results1_df.shape[0])

# Display the first 10 rows of the DataFrame
results1_df.head(10)

41

                BusinessName  scores.Hygiene
0        The Chase Rest Home              20
1                 Brenalwood              20
2              Melrose Hotel              20
3              Seaford Pizza              20
4              Golden Palace              20
5           Ashby's Butchers              20
6  South Sea Express Cuisine              20
7              Golden Palace              20
8             The Tulip Tree              20
9                      F & S              20

In [9]:
#ADDED CELL
#1. Which establishments have a hygiene score equal to 20?
# Answer: see the full list below
results1_df

                                         BusinessName  scores.Hygiene
0                                 The Chase Rest Home              20
1                                          Brenalwood              20
2                                       Melrose Hotel              20
3                                       Seaford Pizza              20
4                                       Golden Palace              20
5                                    Ashby's Butchers              20
6                           South Sea Express Cuisine              20
7                                       Golden Palace              20
8                                      The Tulip Tree              20
9                                               F & S              20
10                                          Longhouse              20
11  Westview Playgroup Based At Downsview Comm Pri...              20
12                        Whatever The Weather Coffee              20
13                        Kings Restaurant (Oriental)              20
14                                            Xich Lo              20
15      Asian Supermarket Ltd: T/A Best Food Wine Ltd              20
16                                             Londis              20
17                                         Costcutter              20
18                                       La Simon Ltd              20
19                                     Caribiscus Ltd              20
20                              Kennedy Fried Chicken              20
21                                          Gah Shing              20
22                                     A1 News & Wine              20
23                                      Cakes & Bakes              20
24                        Sahajanand Catering Limited              20
25                                         Sisko Cafe              20
26                             Magazin Romanesc Diana              20
27                                      Bali Maamalas              20
28                                      Angels Bakery              20
29                            Nikkis Place Restaurant              20
30                                         Chicago 30              20
31                              Samui Thai Restaurant              20
32                            Pakhtoonkhwa Restaurant              20
33                                   New Happy Garden              20
34                                          Mummy Yum              20
35                                          Gospodina              20
36                                  Leo's Bar & Grill              20
37                                         Royal Ribs              20
38                      Great Hallingbury Manor Hotel              20
39                                   The Dog And Duck              20
40                                   Oriental Cottage              20

### 2. Which establishments in London have a `RatingValue` greater than or equal to 4?

In [10]:
# Find the establishments with London as the Local Authority and has a RatingValue greater than or equal to 4.

# Creating Query
query2 = {'LocalAuthorityName': {'$regex':'London'}, 'RatingValue': {'$gte':4}}

# Creating Fields to Display to Minimize Clutter
fields2 = {'LocalAuthorityName':1,
         'RatingValue':1, '_id': 0}

# Finding Results
results2 = list(establishments.find(query2, fields2))

# Use count_documents to display the number of documents in the result
pprint(establishments.count_documents(query2))

# Display the first document in the results using pprint
pprint(results2[0])

33
{'LocalAuthorityName': 'City of London Corporation', 'RatingValue': 4}

In [11]:
# Convert the result to a Pandas DataFrame
results2_df = pd.json_normalize(results2)

# Display the number of rows in the DataFrame
pprint(results2_df.shape[0])

# Display the first 10 rows of the DataFrame
results2_df.head(10)

33

   RatingValue          LocalAuthorityName
0            4  City of London Corporation
1            5  City of London Corporation
2            4  City of London Corporation
3            5  City of London Corporation
4            5  City of London Corporation
5            5  City of London Corporation
6            5  City of London Corporation
7            4  City of London Corporation
8            5  City of London Corporation
9            5  City of London Corporation

In [12]:
#ADDED CELL
#2. Which establishments in London have a RatingValue greater than or equal to 4?
# See full list below
results2_df

    RatingValue          LocalAuthorityName
0             4  City of London Corporation
1             5  City of London Corporation
2             4  City of London Corporation
3             5  City of London Corporation
4             5  City of London Corporation
5             5  City of London Corporation
6             5  City of London Corporation
7             4  City of London Corporation
8             5  City of London Corporation
9             5  City of London Corporation
10            5  City of London Corporation
11            5  City of London Corporation
12            5  City of London Corporation
13            5  City of London Corporation
14            5  City of London Corporation
15            4  City of London Corporation
16            5  City of London Corporation
17            5  City of London Corporation
18            5  City of London Corporation
19            5  City of London Corporation
20            5  City of London Corporation
21            5  City of London Corporation
22            5  City of London Corporation
23            5  City of London Corporation
24            5  City of London Corporation
25            5  City of London Corporation
26            5  City of London Corporation
27            5  City of London Corporation
28            5  City of London Corporation
29            5  City of London Corporation
30            5  City of London Corporation
31            5  City of London Corporation
32            5  City of London Corporation

### 3. What are the top 5 establishments with a `RatingValue` rating value of 5, sorted by lowest hygiene score, nearest to the new restaurant added, "Penang Flavours"?

In [13]:
# Search within 0.01 degree on either side of the latitude and longitude.
# Rating value must equal 5
# Sort by hygiene score
# Get Penang Flavours document

# Creating Preliminary Query Variables
query_penang_flavours = {'BusinessName': "Penang Flavours"}
penang_result = establishments.find_one(query_penang_flavours)

degree_search = 0.01
latitude = penang_result['geocode']['latitude']
longitude = penang_result['geocode']['longitude']

# Creating Query
query3 = {'RatingValue': 5,
            'geocode.latitude': {
                '$gte': latitude - degree_search, 
                '$lte': latitude + degree_search
                },
            'geocode.longitude': {
                '$gte': longitude - degree_search, 
                '$lte': longitude + degree_search
             }
        }

# Creating Fields to Display to Minimize Clutter
fields3 = {'RatingValue': 1, 
          'geocode.latitude': 1, 
          'geocode.longitude': 1, 
          'scores.Hygiene': 1,
          'BusinessName': 1,
          '_id':0}

# Creating Sort for scores.Hygiene
sort3 =  [('scores.Hygiene', 1)]

# Finding Results
results3 = list(establishments.find(query3, fields3).sort(sort3).limit(5))

# Print the results
pprint(results3)

[{'BusinessName': 'Volunteer',
  'RatingValue': 5,
  'geocode': {'latitude': 51.4873437, 'longitude': 0.09208},
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Plumstead Manor Nursery',
  'RatingValue': 5,
  'geocode': {'latitude': 51.481517791748, 'longitude': 0.0859939977526665},
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Atlantic Fish Bar',
  'RatingValue': 5,
  'geocode': {'latitude': 51.4867296, 'longitude': 0.0912164},
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Iceland',
  'RatingValue': 5,
  'geocode': {'latitude': 51.4871482849121, 'longitude': 0.0924199968576431},
  'scores': {'Hygiene': 0}},
 {'BusinessName': 'Howe and Co Fish and Chips - Van 17',
  'RatingValue': 5,
  'geocode': {'latitude': 51.4875335693359, 'longitude': 0.0925370007753372},
  'scores': {'Hygiene': 0}}]

In [14]:
# Convert result to Pandas DataFrame
top5_london_df = pd.json_normalize(results3)

# Print number of Rows
pprint(top5_london_df.shape[0])

# Display the top 5 answering Question#3
top5_london_df.head()

5

,BusinessName,RatingValue,scores.Hygiene,geocode.longitude,geocode.latitude
0,Volunteer,5,0,0.092080,51.487344
1,Plumstead Manor Nursery,5,0,0.085994,51.481518
2,Atlantic Fish Bar,5,0,0.091216,51.486730
3,Iceland,5,0,0.092420,51.487148
4,Howe and Co Fish and Chips - Van 17,5,0,0.092537,51.487534

### 4. How many establishments in each Local Authority area have a hygiene score of 0?

In [15]:
# Create a pipeline that: 
# 1. Matches establishments with a hygiene score of 0
# 2. Groups the matches by Local Authority
# 3. Sorts the matches from highest to lowest

# Creating Match Query
match_query4 = {'$match': {
                    'scores.Hygiene': 0}
              }

# Print the number of documents in the result
group_query4 = {'$group': {
    '_id':{
        'LocalAuthorityName': '$LocalAuthorityName'
    },
    'count':{'$sum': 1}
  }
}

# Creating Sort on count for "Local Authority"
sort_values4 = {'$sort': {'count': -1}}

# Creating Pipeline
pipeline = [match_query4, group_query4, sort_values4]

# Finding Results
results4 = list(establishments.aggregate(pipeline))

# Print the first 10 results
pprint(results4[:10])

[{'_id': {'LocalAuthorityName': 'Thanet'}, 'count': 1130},
 {'_id': {'LocalAuthorityName': 'Greenwich'}, 'count': 882},
 {'_id': {'LocalAuthorityName': 'Maidstone'}, 'count': 713},
 {'_id': {'LocalAuthorityName': 'Newham'}, 'count': 711},
 {'_id': {'LocalAuthorityName': 'Swale'}, 'count': 686},
 {'_id': {'LocalAuthorityName': 'Chelmsford'}, 'count': 680},
 {'_id': {'LocalAuthorityName': 'Medway'}, 'count': 672},
 {'_id': {'LocalAuthorityName': 'Bexley'}, 'count': 607},
 {'_id': {'LocalAuthorityName': 'Southend-On-Sea'}, 'count': 586},
 {'_id': {'LocalAuthorityName': 'Tendring'}, 'count': 542}]

In [16]:
# Convert the result to a Pandas DataFrame
results4_df = pd.json_normalize(results4)

# Make column to align with project specification
results4_df = results4_df.rename(columns={'_id.LocalAuthorityName':'_id'})

# Display the number of rows in the DataFrame
pprint(results4_df.shape[0])

# Display the first 10 rows of the DataFrame
results4_df.head(10)

55

   count              _id
0   1130           Thanet
1    882        Greenwich
2    713        Maidstone
3    711           Newham
4    686            Swale
5    680       Chelmsford
6    672           Medway
7    607           Bexley
8    586  Southend-On-Sea
9    542         Tendring

In [17]:
# 4. How many establishments in each Local Authority area have a hygiene score of 0?
# See full answer below
results4_df

    count                         _id
0    1130                      Thanet
1     882                   Greenwich
2     713                   Maidstone
3     711                      Newham
4     686                       Swale
5     680                  Chelmsford
6     672                      Medway
7     607                      Bexley
8     586             Southend-On-Sea
9     542                    Tendring
10    498                  Colchester
11    491             Tunbridge Wells
12    480        Folkestone and Hythe
13    478                  Eastbourne
14    464                    Hastings
15    460                     Bromley
16    427                     Ashford
17    397                    Havering
18    383                    Dartford
19    382                   Braintree
20    362                    Basildon
21    339                   Gravesham
22    325       Tonbridge and Malling
23    313                    Thurrock
24    301        Barking and Dagenham
25    298             Canterbury City
26    285                   Brentwood
27    281                Castle Point
28    274                      Harlow
29    251                  Uttlesford
30    250                       Lewes
31    223                   Sevenoaks
32    197                      Maldon
33    189          East Hertfordshire
34    187                    Rochford
35    182                   Redbridge
36    180               Epping Forest
37    159                East Suffolk
38    110              Waltham Forest
39     97                     Babergh
40     93                     Wealden
41     80                      Rother
42     65                    Lewisham
43     42                   Tandridge
44     28  City of London Corporation
45     21                     Ipswich
46      9               Tower Hamlets
47      6         North Hertfordshire
48      5                  Mid Sussex
49      1               North Norfolk
50      1                  Sunderland
51      1                     Reading
52      1                      Dorset
53      1      Kensington and Chelsea
54      1                  Broxbourne